---
kind: type
id: T:Autodesk.Revit.DB.Extrusion
source: html/1d8cca8f-0ef5-0cb6-a33b-f044b968cd89.htm
---
# Autodesk.Revit.DB.Extrusion

A extrusion solid or void form.

## Syntax (C#)
```csharp
public class Extrusion : GenericForm
```